In [1]:
!pip install sqlalchemy

Collecting sqlalchemy
  Downloading SQLAlchemy-1.3.22-cp39-cp39-win_amd64.whl (1.2 MB)
Installing collected packages: sqlalchemy
Successfully installed sqlalchemy-1.3.22

In [8]:
!pip install psycopg2

Collecting psycopg2
  Downloading psycopg2-2.8.6-cp39-cp39-win_amd64.whl (1.2 MB)
Installing collected packages: psycopg2
Successfully installed psycopg2-2.8.6

In [9]:
import pandas as pd
import psycopg2
from sqlalchemy import create_engine

In [10]:
#engine = create_engine('postgresql://nomeusuario:senhausuario@nomeservidor:portaservidor/nomebanco')
engine = create_engine('postgresql://postgres:151322@localhost:5432/postgres')

In [11]:
investimentos = pd.read_sql('SELECT * FROM investimento', engine)

In [14]:
investimentos.head()

   id  startup_id  investidor_id        valor data_realizada   obs
0   1           1            1.0  200000000.0     2020-01-09  None
1   2           2            2.0    8048394.0     2020-01-13  None
2   3           3            3.0   18358860.0     2020-01-09  None
3   4           4            4.0    3000000.0     2020-01-02  None
4   5           5            5.0    1800000.0     2020-01-02  None

In [15]:
investimentos2 = pd.read_sql_table('investimento', engine)

In [17]:
investimentos2.head()

   id  startup_id  investidor_id        valor data_realizada   obs
0   1           1            1.0  200000000.0     2020-01-09  None
1   2           2            2.0    8048394.0     2020-01-13  None
2   3           3            3.0   18358860.0     2020-01-09  None
3   4           4            4.0    3000000.0     2020-01-02  None
4   5           5            5.0    1800000.0     2020-01-02  None

In [18]:
invest = pd.read_sql_table('startup', engine)

In [19]:
invest.head()

,id,nome,industria_vertical,sub_industria_vertical,cidade_id
0,1,BYJU’S,E-Tech,E-learning,1.0
1,2,Shuttl,Transportation,App based shuttle service,2.0
2,3,Mamaearth,E-commerce,Retailer of baby and toddler products,1.0
3,4,https://www.wealthbucket.in/,FinTech,Online Investment,3.0
4,5,Fashor,Fashion and Apparel,Embroiled Clothes For Women,4.0